# 功能：获取文档固定文本部分，按照章节情况将内容保存到一个字典中
# 这一块内容其实适合存储到数据库中，这样结构就会特别清晰,也会便于维护,另外就是目前每一个变量都分的很清，其实没有必要。可优化
# date:20210219
# author:aaa

class get_ybwb(object):
    '''获取文档固定文本部分，按照章节情况将内容保存到一个字典中'''

    def hqnr(self):
        '''获取文档固定文本部分，按照章节情况将内容保存到一个字典中'''
        ################################## 第一章 3 ##################################
        jb1_1 = "第1章\t名词术语"
        jb2_11 = "1.1\t任务调度类型"
        nr01 = "任务调度状态有以下4种类型："
        nr02 = "1、正常调度：自动参与系统的周期性调度，被日常调度，可配置任务调度周期，如日、周、月等。"
        nr03 = "2、手动调度：需要手动触发任务的运行，不会被日常调度。"
        nr04 = "3、暂停：被日常调度，但启动调度时直接被置为失败（没有实际运行）。"
        nr05 = "4、空跑调度：被日常调度，但启动调度时直接被置为成功（没有实际运行）。"
        nr06 = "调度生效期：在配置任务调度时，需要设置任务生效时间起和任务生效时间止。任务的配置仅在调度生效期内有效。"
        jb2_11 = {jb2_11: [nr01, nr02, nr03, nr04, nr05, nr06]}
        jb2_12 = "1.2\t任务类型"
        nr01 = "任务类型有以下几种："
        nr02 = "1、同步任务：通过前台配置脚本或者配置任务属性实现数据同步。"
        nr03 = "2、ODPS SQL：通过SQL任务实现任务加工。"
        nr04 = "3、工作流：又称组合节点，由多个节点任务组合而成。(节点任务是NODE_TASK，是一个独立的任务。包括：同步任务、ODPS SQL任务、虚节点、Shell等。)"
        nr05 = "例如：生成数据字典需要数据同步、数据加工及数据推送3个任务完成。通过一个工作流任务可实现3个任务的统一管理，该工作流任务包括3个子任务。"
        nr06 = "4、虚节点：没有节点代码，可以作为上游或下游的依赖来控制节点调度，不占用计算资源。虚节点的主要作用有两点：管理启动时间和方便配置依赖。"
        nr07 = "优点1：便于管控任务启动时间。例如，设置一个虚拟节点（作为上游依赖节点），征收、登记等13个业务域的任务都依赖于该虚拟节点。只需设置该虚拟节点的启动时间为12:10分，则下游的13个任务都是12:10启动。"
        nr08 = "优点2：方便批量配置依赖。例如，基础层的HX_DJ_DJ_NSRXX表有36个任务，分别对应36家税务单位，设置一个虚节点（作为这36个任务的下游依赖，中间层表的上游依赖）依赖于这36个任务，则中间层只需依赖该虚拟节点而不用继续依赖36个任务。"
        nr09 = "5、Shell：可封装数据加工任务、数据同步任务等其他各种类型的任务，用Shell脚本实现任务的自定义配置。"
        nr10 = "6、ODPS MR：即ODPS MapReduce，分布式计算的任务，可用于解决复杂问题。"
        jb2_12 = {jb2_12: [nr01, nr02, nr03, nr04, nr05, nr06, nr07, nr08, nr09, nr10]}
        jb2_13 = "1.3\t任务运行状态"
        nr01 = "任务运行状态有未运行、等待时间、等待资源、运行中、成功、失败，下面对未运行、等待资源以及等待时间进行说明:"
        nr02 = "1、未运行：上游节点未完成。"
        nr03 = "2、等待时间：节点未到调度时间。"
        nr04 = "3、等待资源：等待分配调度资源。"
        nr05 = "例如：A任务的调度时间为每日1:00，且A任务依赖于上游B任务。"
        nr06 = "（1）当B任务的状态不是成功时，A任务的状态为未运行；"
        nr07 = "（2）当B任务运行成功后，还未到A任务的调度时间1:00，则A任务的状态为等待时间；"
        nr08 = "（3）当A到1:00时，若没有足够的资源可运行时，A任务的状态为等待资源。"
        jb2_13 = {jb2_13: [nr01, nr02, nr03, nr04, nr05, nr06, nr07, nr08]}
        # jb1_1 = {jb1_1:[jb2_11,jb2_12,jb2_13]}

        ################################## 第二章 3 ##################################
        jb1_2 = "第2章\t云平台任务总述"
        jb2_21 = "2.1\t云平台任务概述"
        nr01 = "云平台将离线数据划分为4个数据层，分别是镜像层、基础层、中间层和模型层。每个数据层根据其不同需求可创建相应的项目。"
        jb2_21 = {jb2_21: [nr01]}
        jb2_22 = "2.2\t云平台任务调度情况"
        nr01 = "云平台任务调度类型有正常调度、暂停调度、手动调度以及空跑调度4种。对重点关注的生产项目空间的任务调度类型分数据层统计如下："
        jb2_22 = {jb2_22: [nr01]}
        jb2_23 = "2.3\t云平台任务运行状态"
        nr01 = "对重点关注的生产项目空间中正常调度任务的运行状态分数据层统计如下："
        jb2_23 = {jb2_23: [nr01]}

        ################################## 第三章 3.2和3.3是三层结构 3 ##################################
        jb1_3 = "第3章\t镜像层任务运行情况"

        jb2_31 = "3.1\t镜像层总体任务概述"
        nr01 = '（注：镜像层生产项目统计口径：项目空间名称以"SC_JX_"开头，且不包含“SC_JX_ZRRYH%”,"SC_JX_DQYS"）'
        nr02 = "生产项目空间的任务数量统计如下表："
        jb2_31 = {jb2_31: [nr01, nr02]}

        jb2_32 = "3.2\t任务运行情况分析"
        jb3_3201 = "3.2.1\t任务调度类型统计"
        jb3_3201 = {jb3_3201: []}
        jb3_3202 = "3.2.2\t正常调度任务类型统计"
        jb3_3202 = {jb3_3202: []}
        jb2_32 = {jb2_32: [jb3_3201, jb3_3202]}

        jb2_33 = "3.3\t任务运行状态分析"
        jb3_3301 = "3.3.1\t任务运行状态统计"
        jb3_3301 = {jb3_3301: []}
        jb2_33 = {jb2_33: [jb3_3301]}

        ################################## 第四章 4.2是三层结构 5 ##################################
        jb1_4 = "第4章\t基础层任务运行情况"
        jb2_41 = "4.1\t基础层总体任务概述"
        jb2_41 = {jb2_41: []}

        jb2_42 = "4.2\t任务运行情况分析"
        jb3_4201 = "4.2.1\t任务调度类型统计"
        jb3_4201 = {jb3_4201: []}
        jb3_4202 = "4.2.2\t正常调度任务类型统计"
        jb3_4202 = {jb3_4202: []}
        jb2_42 = {jb2_42: [jb3_4201, jb3_4202]}

        jb2_43 = "4.3\t任务运行状态分析"
        nr01 = "经分析，"
        jb2_43 = {jb2_43: [nr01]}

        jb2_44 = "4.4\t任务运行所占资源分析"
        nr01 = "一个任务可能包含多个SQL脚本，资源的统计可统计每个SQL脚本运行所占的计算资源。因此统计任务运行所占资源时，只能通过统计实例运行消耗的计算资源，得到该实例所属的任务，从而得到消耗计算资源最高的任务。"
        nr02 = "基础层的生产项目（SC_JC_GSZJ、SC_JC_GSAQ），消耗计算资源最高排名前10的任务如下表所示："
        jb2_44 = {jb2_44: [nr01, nr02]}

        jb2_45 = "4.5\t任务运行时长分析"
        jb2_45 = {jb2_45: []}

        ################################## 第五章 5.2是三层结构 5 ##################################
        jb1_5 = "第5章\t中间层任务运行情况"
        jb2_51 = "5.1\t中间层总体任务概述"
        nr01 = "截至2021年1月31日，中间层共有10个生产项目空间，其中有8个私有空间。私有空间为各省提供自主开发使用，不做日常运维，因此不做展开分析。中间层的生产项目空间如下表所示。"
        nr02 = '（注：中间层生产项目统计口径：项目空间名称以“SC _ZJ_"开头，且不包含"SC_ZJ_ZRRYH"）'
        jb2_51 = {jb2_51: [nr01, nr02]}

        jb2_52 = "5.2\t任务运行情况分析"
        jb3_5201 = "5.2.1\t任务调度类型统计"
        jb3_5201 = {jb3_5201: []}
        jb3_5202 = "5.2.2\t正常调度任务类型统计"
        jb3_5202 = {jb3_5202: []}
        jb2_52 = {jb2_52: [jb3_5201, jb3_5202]}

        jb2_53 = "5.3\t任务运行状态分析"
        jb2_53 = {jb2_53: []}

        jb2_54 = "5.4\t任务运行所占资源分析"
        nr01 = "中间层任务运行所占资源统计与基础层任务运行所占资源统计方法相同。中间层的生产项目中（SC_ZJ_GSZJ、SC_ZJ_GSZJ_2），消耗计算资源最高排名前10的任务如下表所示。"
        jb2_54 = {jb2_54: [nr01]}

        jb2_55 = "5.5\t任务运行时长分析"
        jb2_55 = {jb2_55: []}

        ################################## 第六章 6.2是三层结构 5 ##################################
        jb1_6 = "第6章\t模型层任务运行情况"
        jb2_61 = "6.1\t模型层总体任务概述"
        jb2_61 = {jb2_61: []}

        jb2_62 = "6.2\t任务运行情况分析"
        jb3_6201 = "6.2.1\t任务调度类型统计"
        jb3_6201 = {jb3_6201: []}
        jb3_6202 = "6.2.2\t正常调度任务类型统计"
        jb3_6202 = {jb3_6202: []}
        jb2_62 = {jb2_62: [jb3_6201, jb3_6202]}

        jb2_63 = "6.3\t任务运行状态分析"
        jb2_63 = {jb2_63: []}

        jb2_64 = "6.4\t任务运行所占资源分析"
        nr01 = "模型层生产项目空间的任务运行所占资源统计与基础层任务运行所占资源统计方法相同。模型层的生产项目中，消耗计算资源最高排名前10的任务如下表所示："
        jb2_64 = {jb2_64: [nr01]}

        jb2_65 = "6.5\t任务运行时长分析"
        jb2_65 = {jb2_65: []}

        ################################## 第七章 7.1是三层结构 1 ##################################
        jb1_7 = "第7章\t任务运行总结与建议"
        jb2_71 = "7.1\t云平台数据开发人员"
        jb3_7101 = "7.1.1\t镜像层"
        jb3_7101 = {jb3_7101: []}
        jb3_7102 = "7.1.2\t基础层"
        jb3_7102 = {jb3_7102: []}
        jb3_7103 = "7.1.3\t中间层"
        jb3_7103 = {jb3_7103: []}
        jb3_7104 = "7.1.4\t模型层"
        jb3_7104 = {jb3_7104: []}
        jb3_7105 = "7.1.5\t总结"
        nr01 = "2020年12月月报总结跟踪情况如下："
        nr02 = "1、镜像层任务"
        nr03 = "2、基础层任务"
        nr04 = "3、中间层任务"
        nr05 = "4、模型层任务"
        jb3_7105 = {jb3_7105: [nr01, nr02, nr03, nr04, nr05]}
        jb2_71={jb2_71:[jb3_7101,jb3_7102,jb3_7103,jb3_7104,jb3_7105]}

        # 将所有的组成大字典，不用列表可以减少一层关系
        all_text = {
            jb1_1: [jb2_11, jb2_12, jb2_13],
            jb1_2: [jb2_21, jb2_22, jb2_23],
            jb1_3: [jb2_31, jb2_32, jb2_33],
            jb1_4: [jb2_41, jb2_42, jb2_43, jb2_44, jb2_45],
            jb1_5: [jb2_51, jb2_52, jb2_53, jb2_54, jb2_55],
            jb1_6: [jb2_61, jb2_62, jb2_63, jb2_64, jb2_65],
            jb1_7: [jb2_71]
        }

        return all_text
